import type { Route } from '@/types';

import { handler } from './index';

export const route: Route = {
    path: '/company/:id',
    categories: ['new-media'],
    example: '/logclub/company/14',
    parameters: { id: '企业 id，见下表，可在对应企业页 URL 中找到' },
    features: {
        antiCrawler: true,
    },
    radar: [
        {
            source: ['logclub.com/company/:id'],
            target: '/company/:id',
        },
    ],
    name: '大企业',
    maintainers: ['nczitzk'],
    handler,
    description: `#### 明星企业

| 顺丰 | 菜鸟 | 京东物流 | 德邦快递 / 德邦股份 |
| ---- | ---- | -------- | ------------------- |
| 14   | 56   | 453      | 145                 |

| 百世集团 | 中国物流集团 | 极兔速递 | 中通快递 |
| -------- | ------------ | -------- | -------- |
| 116      | 6807         | 3246     | 132      |

前往 [更多](https://www.logclub.com/columnist/more/star) 查看更多企业

#### 综合物流 / 供应链企业

| 锐特信息 | 中国物流与采购网 | 则一 | 普路通 |
| -------- | ---------------- | ---- | ------ |
| 716      | 525              | 524  | 464    |

| 安得智联 | 集保中国 | 上汽安吉物流 | 苏宁物流 |
| -------- | -------- | ------------ | -------- |
| 215      | 147      | 15           | 12       |

| 准时达 | 深国际 | 益邦控股 | 卓志跨境供应链 |
| ------ | ------ | -------- | -------------- |
| 158    | 167    | 758      | 130            |

| 日日顺 | 传化智联 | CJ 荣庆物流 | 江苏飞力达 |
| ------ | -------- | ----------- | ---------- |
| 179    | 166      | 770         | 548        |

前往 [更多](https://www.logclub.com/columnist/more/integrated_logistics) 查看更多企业

#### 快递 / 快运企业

| 盛丰物流 | 跨越速运 | 顺心捷达 | 中国邮政 |
| -------- | -------- | -------- | -------- |
| 819      | 372      | 327      | 134      |

| 韵达 | 申通快递 | 圆通 | 壹米滴答集团 |
| ---- | -------- | ---- | ------------ |
| 113  | 137      | 143  | 97           |

| 安能物流 | 联邦快递 FedEx | UPS | DHL |
| -------- | -------------- | --- | --- |
| 151      | 104            | 388 | 219 |

| 优速快递 | 中铁快运 | 德坤物流 | 商桥物流 |
| -------- | -------- | -------- | -------- |
| 1243     | 1015     | 2254     | 99       |

前往 [更多](https://www.logclub.com/columnist/more/express) 查看更多企业

#### 系统 / 智能平台 / 智能硬件 / 设施企业

| 甲子光年 | 炬星科技 | 斑马智行 | 智行者 |
| -------- | -------- | -------- | ------ |
| 700      | 665      | 540      | 510    |

| 纵行科技 | 行深智能 | 地上铁 | 图森未来 |
| -------- | -------- | ------ | -------- |
| 509      | 508      | 500    | 445      |

| oTMS 运输管理云平台 | 聚龄供应链 | 博科资讯 | 富勒 FLUX |
| ------------------- | ---------- | -------- | --------- |
| 53                  | 5806       | 6870     | 122       |

| 科箭软件 | 通天晓软件 | 嬴彻科技 | 货车宝 |
| -------- | ---------- | -------- | ------ |
| 180      | 503        | 462      | 129    |

前往 [更多](https://www.logclub.com/columnist/more/intellectualization) 查看更多企业

#### 货运 / 配送平台 / 仓储 / 地产企业

| 卡力互联 | 想乐送 | 宝湾物流 | 卡车之家 |
| -------- | ------ | -------- | -------- |
| 1660     | 1558   | 1031     | 365      |

| 罗宾升 | 好多车 | 饿了么 | 闪送 |
| ------ | ------ | ------ | ---- |
| 308    | 269    | 172    | 80   |

| 宏昌物流园 | 路歌互联网物流平台 | 福佑卡车 | 普洛斯 |
| ---------- | ------------------ | -------- | ------ |
| 6816       | 182                | 18       | 150    |

| 菜鸟速递 | 达达集团 | 满帮集团 | 货拉拉 |
| -------- | -------- | -------- | ------ |
| 1972     | 748      | 193      | 79     |

前往 [更多](https://www.logclub.com/columnist/more/freight_transport) 查看更多企业

#### 证券交运 / 咨询机构

| 罗戈网 | 物流沙龙 | 罗戈研究 | 招商证券 |
| ------ | -------- | -------- | -------- |
| 17     | 21       | 26       | 51       |

| 兴业证券 | 环球物流咨询规划 | 华创证券 | 艾瑞咨询 |
| -------- | ---------------- | -------- | -------- |
| 161      | 29               | 1287     | 58       |

| 安信证券 | 天风证券 | 方正证券 | 中信证券 |
| -------- | -------- | -------- | -------- |
| 1295     | 1136     | 1169     | 469      |

| 申万宏源证券 | 国海证券 | 华泰证券 | 东方证券 |
| ------------ | -------- | -------- | -------- |
| 1296         | 6381     | 2119     | 1772     |

前往 [更多](https://www.logclub.com/columnist/more/securities_delivery) 查看更多企业

#### 资本

| 源码资本 | 华兴资本 | IDG 资本 | 元赋资本 |
| -------- | -------- | -------- | -------- |
| 1037     | 931      | 787      | 393      |

| 钟鼎资本 | 红杉资本 |
| -------- | -------- |
| 159      | 5265     |

前往 [更多](https://www.logclub.com/columnist/more/capital) 查看更多企业`,
};
